#---*------*------*------*------*------*------*------*------*---
.eqv read_only 0 
.eqv write_only 1 
.eqv write_append 9 

.macro open_file(%path, %flag)
	li a7 1024
	la a0 %path
	li a1 %flag
	ecall
.end_macro
#---------------------------------------------------------------

#---*------*------*------*------*------*------*------*------*---
.macro get_str(%bufer, %size)
li a7 8
la a0 %bufer
li a1 %size
ecall

push(s0)
push(s1)
push(s2)

li s0 '\n'
la s1 %bufer
loop:
	lb s2 (s1)
	beq s2 s0 replace
	addi s1 s1 1
	b loop
	
replace:
	sb zero (s1)
	pop(s2)
	pop(s1)
	pop(s0)
	
.end_macro
#---------------------------------------------------------------

#---*------*------*------*------*------*------*------*------*---
.macro push(%x)
	addi sp sp -4
	sw %x (sp)
.end_macro
#---------------------------------------------------------------

#---*------*------*------*------*------*------*------*------*---
.macro pop(%x)
	lw %x, (sp)
	addi sp sp 4
.end_macro
#---------------------------------------------------------------

#---*------*------*------*------*------*------*------*------*---
.macro print_text(%x)
	la a0 %x
	li a7 4
	ecall
.end_macro
#---------------------------------------------------------------

#---*------*------*------*------*------*------*------*------*---
.macro print_int(%x)
	mv a0 %x
	li a7 1
	ecall
.end_macro
#---------------------------------------------------------------

#---*------*------*------*------*------*------*------*------*---
.macro new_line
	li a0 '\n'
	li a7 11
	ecall
.end_macro
#---------------------------------------------------------------

#---*------*------*------*------*------*------*------*------*---
.macro read(%file, %buffer, %size)
	li a7 63
	mv a0 %file
	mv a1 %buffer
	li a2 %size
	ecall
.end_macro
#---------------------------------------------------------------

#---*------*------*------*------*------*------*------*------*---
.macro allocate(%size)
	li a7 9
	li a0 %size
	ecall
.end_macro
#---------------------------------------------------------------

#---*------*------*------*------*------*------*------*------*---
.macro allocate_reg(%size)
	li a7 9
	mv a0 %size
	ecall
.end_macro
#---------------------------------------------------------------

#---*------*------*------*------*------*------*------*------*---
.macro find_lb(%start, %num)
	li t0 '\n'
	li t1 0 # Индекс первого вхождения /n
	li t2 0 # Счётчик
	mv t3 %start
	mv t4 %num # Для сравнени
	li t5 0 # Количество /n в файле
	
	   
	loop:
		lb a0 (t3)
		beq a0 t0 sym_lb
		
		checking:
		addi t2 t2 1
		addi t3 t3 1
		blt t2 t4 loop
		j end_loop
		
		sym_lb:
			addi t5 t5 1
			li t6 1
			
			beq t5 t6 first_entry
			j checking
			
			first_entry:
				mv t1 t2
				j checking
			
	end_loop:
		mv a0 t1
		mv a1 t5
		j end
	end:
.end_macro 
#---------------------------------------------------------------
